In [ ]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
pip install Pandas

Requirement already satisfied: Pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from Pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from Pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from Pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->Pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [5]:
import pandas as Pd
series = Pd.Series([4,8,15,16,23,42])
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [ ]:
#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the 
#variable print it.

In [8]:
import pandas as pd
var = pd.Series([x * x for x in range(11)])
print(var)

0       0
1       1
2       4
3       9
4      16
5      25
6      36
7      49
8      64
9      81
10    100
dtype: int64

#Q3. Create a Pandas DataFrame that contains the following data

NAME        AGE      GENDER
Alice       25       female
Bob         30        male
claire      27       female

Then, print the DataFrame.

In [4]:
import pandas as pd
dict1 = {'NAME' : ['Alice','Bob','claire'],
         'AGE' : [25,30,27],
        'GENDER': ['female','male','female']}
df = pd.DataFrame(dict1)
df

     NAME  AGE  GENDER
0   Alice   25  female
1     Bob   30    male
2  claire   27  female

In [ ]:
#Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In Pandas, a DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. It is a table or spreadsheet-like data structure that allows you to store and manipulate data in a row-column format. It is a powerful tool for data analysis, data cleaning, and data transformation.

On the other hand, a Pandas Series is a one-dimensional labeled array capable of holding any data type (integer, string, float, python objects, etc.). It is similar to a column in a table, or a single variable in statistics.

The main difference between a Pandas Series and a DataFrame is that a Series represents a single column of data, while a DataFrame consists of multiple columns, with each column represented as a Series. In other words, a DataFrame is a collection of Series objects that share the same index.

In [7]:
#example
import pandas as pd 
data_series = [34,56,86,4,5,6]
d_s = pd.Series(data_series)
dict2 = {'NAME' : ['Aleena','Mitali','shradha mam'],
         'AGE' : [25,20,24],
        'GENDER': ['female','female','female']}
df = pd.DataFrame(dict2)
print("data frame")
df

data frame

          NAME  AGE  GENDER
0       Aleena   25  female
1       Mitali   20  female
2  shradha mam   24  female

In [8]:
print("data series")
d_s

data series

0    34
1    56
2    86
3     4
4     5
5     6
dtype: int64

In [ ]:
#Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Canyou give an example of when you might use 
#one of these functions?


1.df.head(n) and df.tail(n):
These functions are used to display the first or last n rows of a DataFrame, respectively. This can be useful for quickly checking the structure and contents of a DataFrame.

2. df.describe():
This function generates descriptive statistics of the DataFrame, including count, mean, standard deviation, minimum, maximum, and quartiles. This can be helpful for gaining a quick understanding of the data.

3. df.info():
This function displays information about the DataFrame, including the data types, non-null counts, and memory usage. This can be useful for checking the integrity of the data and identifying potential data quality issues.

4. df.dropna():
This function drops any rows with missing values (NaN) from the DataFrame. This can be helpful for cleaning up the data before analysis.

5. df.groupby():
This function groups the DataFrame by one or more columns and returns a new DataFrame with the groups. This can be useful for performing group-wise analysis or aggregations.


6.df.apply():
This function applies a function to each element in a DataFrame or to a column or row of the DataFrame. This can be useful for performing custom transformations or calculations on the data.

In [20]:
import pandas as pd
data = {'customer_id': [1, 2, 3, 4, 5],
        'product_id': [101, 102, 103, 104, 105],
        'category': ['clothing', 'electronics', 'clothing', 'books', 'electronics'],
        'price': [50, 100, 75, 20, 80]}
df = pd.DataFrame(data)
df

   customer_id  product_id     category  price
0            1         101     clothing     50
1            2         102  electronics    100
2            3         103     clothing     75
3            4         104        books     20
4            5         105  electronics     80

In [11]:
df.describe()

       customer_id  product_id      price
count     5.000000    5.000000    5.00000
mean      3.000000  103.000000   65.00000
std       1.581139    1.581139   30.82207
min       1.000000  101.000000   20.00000
25%       2.000000  102.000000   50.00000
50%       3.000000  103.000000   75.00000
75%       4.000000  104.000000   80.00000
max       5.000000  105.000000  100.00000

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  5 non-null      int64
 1   product_id   5 non-null      int64
 2   category     5 non-null      object
 3   price        5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 288.0+ bytes

In [22]:
df.groupby('category')['price'].sum()

category
books           20
clothing       125
electronics    180
Name: price, dtype: int64

In [ ]:
#Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In pandas, Series and DataFrame are mutable in nature.
Panel is considered immutable.
That means, Series and DataFrame objects can be modified after they are created, and any changes made to them will be reflected in the original objects. On the other hand, Panel objects are generally not modified once created, and any changes made to them usually result in the creation of a new object.
Note that while Series and DataFrame objects are mutable, it is generally recommended to avoid modifying them in place, as this can lead to unexpected results and errors. Instead, it is often better to create a new object with the desired modifications.

In [23]:
#Q7. Create a DataFrame using multiple Series. Explain with an example.

#creating a series 
names = pd.Series(['Aman', 'vikas', 'lovely', 'David'])
ages = pd.Series([23,45,34,43])
sal = pd.Series([500000,600000,330000])

# Combine the Series into a DataFrame
data = {'Name': names, 'Age': ages, 'Salary': sal}
df = pd.DataFrame(data)

# Print the resulting DataFrame
df

     Name  Age    Salary
0    Aman   23  500000.0
1   vikas   45  600000.0
2  lovely   34  330000.0
3   David   43       NaN